<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [digilib-devel] digilib
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/digilib-devel/2008-August/index.html" >
   <LINK REL="made" HREF="mailto:digilib-devel%40lists.berlios.de?Subject=Re%3A%20%5Bdigilib-devel%5D%20digilib&In-Reply-To=%3C48B6BE15.2050505%40mpiwg-berlin.mpg.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000001.html">
   
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[digilib-devel] digilib</H1>
    <B>Robert Casties</B> 
    <A HREF="mailto:digilib-devel%40lists.berlios.de?Subject=Re%3A%20%5Bdigilib-devel%5D%20digilib&In-Reply-To=%3C48B6BE15.2050505%40mpiwg-berlin.mpg.de%3E"
       TITLE="[digilib-devel] digilib">casties at mpiwg-berlin.mpg.de
       </A><BR>
    <I>Thu Aug 28 17:02:45 CEST 2008</I>
    <P><UL>
        <LI>Previous message: <A HREF="000001.html">[digilib-devel] digilib
</A></li>
        
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#2">[ date ]</a>
              <a href="thread.html#2">[ thread ]</a>
              <a href="subject.html#2">[ subject ]</a>
              <a href="author.html#2">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Hallo Alexander,

Alexander Czmiel wrote:
&gt;&gt;<i> Ich hatte auch schon daran gedacht wenigstens eine rechteckige 
</I>&gt;&gt;<i> Markierung zu unterst&#252;tzen, aber man m&#252;sste sich gut &#252;berlegen wie das 
</I>&gt;&gt;<i> zu bedienen ist...
</I>&gt;<i> 
</I>&gt;<i> Rechteckig w&#252;rde f&#252;r den Anfang v&#246;llig gen&#252;gen, denke ich. F&#252;r die 
</I>&gt;<i> Markierung w&#252;rden dann zwei Punkte reichen. Was meist Du mit &quot;bedienen&quot;? 
</I>&gt;<i> Zwei Klicks oder ein aufziehbares Rechteck?
</I>
Wie unterscheidet man es von der Punkt-Markierung? Gibt es einen extra 
Knopf f&#252;r die Rechteck-Markierung? Gibt es mehr als eine 
Rechteck-Markierung?

Sollte man daf&#252;r doch einen getrennten Parameter verwenden? (Spart das 
Kopfzerbrechen &#252;ber das Koordinatenformat.)

&gt;&gt;&gt;<i> 2. W&#228;r es sehr aufwendig die Navigation durch ein Bild per drag&amp;drop 
</I>&gt;&gt;&gt;<i> zu regeln? So &#228;hnlich wie bei Google-Maps.
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Die Animation dazu w&#228;re aufwendig. Ansonsten m&#252;sste man einfach nur 
</I>&gt;&gt;<i> eine Verschiebung um die mit der Maus gezogene Strecke ausf&#252;hren.
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Wenn man will dass beim ziehen gleich frische Bildbereiche erscheinen, 
</I>&gt;&gt;<i> wird es noch aufwendiger.
</I>&gt;<i> 
</I>&gt;<i> Ich bin durch Zufall vor einiger Zeit &#252;ber eine AJAX-Bibliothek 
</I>&gt;<i> gestolpert, die auch &#252;ber den sichtbaren Bereich hinaus schon Bildteile 
</I>&gt;<i> vorl&#228;dt. Leider weiss ich nicht mehr genau was das war. Ich such in 
</I>&gt;<i> einer ruhigen Minute nochmal danach.
</I>&gt;<i> W&#228;re es einfacher, wenn man das Verschieben stufenweise umsetzt?
</I>
Man muss es wahrscheinlich schon per AJAX machen wenn man zus&#228;tzliche 
Bildteile vorladen will. Ansonsten dauert es sicherlich zu lange. Den 
Code daf&#252;r stelle ich mir nicht trivial vor. Schau Dir doch mal an ob es 
dazu eine Library gibt.

&gt;&gt;<i> Meinst Du in der basedir-list in der digilib-config.xml? Das m&#252;sste 
</I>&gt;&gt;<i> recht einfach zu machen sein (ich benutze das ja schon z.B. bei den 
</I>&gt;&gt;<i> error-images). Oder meinst Du im Client?
</I>&gt;<i> 
</I>&gt;<i> Genau. So wie das bei den error-images l&#228;uft. Ich habs nochmal versucht, 
</I>&gt;<i> aber da scheinen noch &#196;nderungen im Code n&#246;tig zu sein. Optimal w&#228;re, 
</I>&gt;<i> wenn man &#252;ber das Servletverzeichnis hinaus gehen k&#246;nnte.
</I>
Das ist dann wieder ein Problem. Man muss eben f&#252;r relative Pfade 
vorgeben worauf sie sich beziehen. Entweder auf das 
JVM-Arbeitsverzeichnis (so m&#252;sste es eigentlich jetzt schon f&#252;r die 
basedir-list sein, probiere doch mal die entsprechenden JVM Optionen) 
oder das Verzeichnis der Webapp.


Gruss
	Robert

-- 
Dr. Robert Casties -- Information Technology Group
Max Planck Institute for the History of Science
Boltzmannstr. 22, D-14195 Berlin
Tel: +49/30/22667-342 Fax: -340

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000001.html">[digilib-devel] digilib
</A></li>
	
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#2">[ date ]</a>
              <a href="thread.html#2">[ thread ]</a>
              <a href="subject.html#2">[ subject ]</a>
              <a href="author.html#2">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/digilib-devel">More information about the digilib-devel
mailing list</a><br>
</body></html>
